class Ar {
  Map<String, String> ar = {
    'app_name': 'Pharaoh\'s Path',
    'welcome_msg': 'Let\'s Make Your Dream Vacation',

    //Auth//////////////////////////////////////////////////////////////////////
    'name': 'اسمك',
    'email': 'بريدك الالكتروني',
    'password': 'كلمة مرورك',
    'required_field': 'حقل مطلوب',
    'capital_letter_msg': 'يجب أن يبدأ بحرف كبير',
    'valid_email_msg': 'لا يبدو كبريد الكتروني صالح',
    'pass_length_msg': 'أدخل على الأقل 8 أحرف',
    'uppercase_letter': 'أدخل على الأقل حرف كبير',
    'lower_letter': 'أدخل على الأقل حرف صغير',
    'one_number': 'أدخل على الأقل رقم',
    'special_character': 'أدخل على الأقل علامة مميزة',
    'your_name': 'ادخل اسمك',
    'your_email': 'ادخل بريدك الالكتروني',
    'your_phone': 'أدخل رقم هاتفك (اختياري)',
    'your_pass': 'ادخل كلمة مرورك',
    'confirm_pass': 'قم بتأكيد كلمة مرورك',
    'sign_up': 'تسجيل',
    'password_match': 'كلمة المرور غير متطابقة',
    'welcome': 'مرحباً',
    'account_created': 'تم إنشاء الحساب بنجاح',
    'thanks': 'شكراً',
    'sign_in': 'دخول',
    'error': 'خطأ',
    'wrong_email': 'البريد الالكتروني خطأ',
    'wrong_password': 'كلمة المرور خطأ',
    'check_it': 'سوف أتأكد',
    'back': 'رجوع',
    'ready_msg': '!مستعد لاستكمال رحلاتك الشيقة',
    'sure': 'بالتأكيد، هيا بنا',
    'or': 'أو',
    'no_account': 'لا يوجد حساب، انشاء واحد؟',

    //Fav///////////////////////////////////////////////////////////////////////
    'fav_places': 'الأماكن المفضلة',
    'no_fav_places': 'لا أماكن مفضلة',
    'arch_gov': 'المحافظات الأثرية',

    //Places////////////////////////////////////////////////////////////////////
    'hi': 'مرحباً',
    'msg': 'اكتشف حضارة الفراعنة',
    'sug_places': 'الأماكن المقترحة',
    'pop_places': 'الأماكن المحبوبة',

    //Profile///////////////////////////////////////////////////////////////////
    'logout': 'تسجيل خروج',
    'delete_account': 'حذف الحساب',
    'yes_please': 'نعم من فضلك',
    'delete_msg': 'انت على وشك حذف حسابك، هل انت متأكد؟',
    'img_source': 'اختر مصدر الصورة',
  };
}
